const menuporno = (prefix) => {

// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 
// NÃO APAGUE ESSE ${NickDono} nem 
//${numerodn} nem ${NomeDoBot} nem ${prefix} só se quiser apagar completo, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa.  
//Sugestão esses comandos ficarem em outro menu
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​


╭────────────
╎
┝  ⎙ +18 PORNO 🔞
╎
╰──────────
|
│❲🩸❳ -➤${prefix}porno (xvideo nome)


╰──────────╮
┝━〢⎙ +18 PACK 🔞
╭──────────╯


│- ➣  🔞 ${prefix}forestfaye

│- ➣  🔞 ${prefix}leticia_shirayuki 

│- ➣  🔞 ${prefix}jenniie 

│- ➣  🔞 ${prefix}alinefaria 

│- ➣  🔞 ${prefix}honey69 

│- ➣  🔞 ${prefix}cclowniac 

│- ➣  🔞 ${prefix}sethi 

│- ➣  🔞 ${prefix}raychiel 

│- ➣  🔞 ${prefix}lais 

│- ➣  🔞 ${prefix}alinefox 

│- ➣  🔞 ${prefix}beatrzz 

│- ➣  🔞 ${prefix}bunni 

│- ➣  🔞 ${prefix}nivnixxi 

│- ➣  🔞 ${prefix}angela 

│- ➣  🔞 ${prefix}callmesloo 

│- ➣  🔞 ${prefix}hannahowo 

│- ➣  🔞 ${prefix}me1adinha 

│- ➣  🔞 ${prefix}cogumay 

│- ➣  🔞 ${prefix}fabiola_mendoza 

│- ➣  🔞 ${prefix}missbrasilia 

│- ➣  🔞 ${prefix}vitacelestine 

│- ➣  🔞 ${prefix}belledelphine 

│- ➣  🔞 ${prefix}mayakayagaia 

│- ➣  🔞 ${prefix}kittykum 

│- ➣  🔞 ${prefix}mackenzie 

│- ➣  🔞 ${prefix}fulltimecrybaby 

│- ➣  🔞 ${prefix}dracuina 

│- ➣  🔞 ${prefix}saekkico 

│- ➣  🔞 ${prefix}lynienicole 

│- ➣  🔞 ${prefix}powrice 

│- ➣  🔞 ${prefix}wendy666 

│- ➣  🔞 ${prefix}shirokitsune 

│- ➣  🔞 ${prefix}moonfox 

│- ➣  🔞 ${prefix}love_lilah

│- ➣  🔞 ${prefix}mcmirella 

╎⩺ ${prefix}mia Khalifa

╰──────────╮

`
}

exports.menuporno = menuporno